zephyrproject-rtos/hal_microchip/packs/pic32c/pic32ck_sg_gc/pic32ck_sg01/include/pic32ck1012sg01064.h
/*
 * Header file for PIC32CK1012SG01064
 *
 * Copyright (c) 2025 Microchip Technology Inc. and its subsidiaries.
 *
 * SPDX-License-Identifier: Apache-2.0
 *
 * Licensed under the Apache License, Version 2.0 (the "License");
 * you may not use this file except in compliance with the License.
 * You may obtain a copy of the License at
 *
 *   http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS,
 * WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
 * See the License for the specific language governing permissions and
 * limitations under the License.
 *
 */

/* File generated from device description file (ATDF) version 2025-07-03T22:18:59Z */
#ifndef _PIC32CK1012SG01064_H_
#define _PIC32CK1012SG01064_H_

/* Header version uses Semantic Versioning 2.0.0 (https://semver.org/) */
#define HEADER_FORMAT_VERSION "2.1.1"

#define HEADER_FORMAT_VERSION_MAJOR (2)
#define HEADER_FORMAT_VERSION_MINOR (1)
#define HEADER_FORMAT_VERSION_PATCH (1)

/* PIC32CK1012SG01064 definitions
  This file defines all structures and symbols for PIC32CK1012SG01064:
    - registers and bitfields
    - peripheral base address
    - peripheral ID
    - PIO definitions
*/

#ifdef __cplusplus
 extern "C" {
#endif

#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
#  include <stdint.h>
#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */

#if !defined(SKIP_INTEGER_LITERALS)
#  if defined(_UINT8_) || defined(_UINT16_) || defined(_UINT32_)
#    error "Integer constant value macros already defined elsewhere"
#  endif

#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
/* Macros that deal with sizes of integer constants for C/C++ */
#  define _UINT8_(x)   ((uint8_t)(x))    /* C code: 8-bits unsigned integer constant value */
#  define _UINT16_(x)  ((uint16_t)(x))   /* C code: 16-bits unsigned integer constant value */
#  define _UINT32_(x)  ((uint32_t)(x))   /* C code: 32-bits unsigned integer constant value */

#else /* Assembler */

#  define _UINT8_(x) x    /* Assembler: 8-bits unsigned integer constant value */
#  define _UINT16_(x) x   /* Assembler: 16-bits unsigned integer constant value */
#  define _UINT32_(x) x   /* Assembler: 32-bits unsigned integer constant value */
#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */
#endif /* SKIP_INTEGER_LITERALS */

/* ************************************************************************** */
/*                  CMSIS DEFINITIONS FOR PIC32CK1012SG01064                  */
/* ************************************************************************** */
#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
/* Interrupt Number Definition */
typedef enum IRQn
{
/******  CORTEX-M33 Processor Exceptions Numbers ******************************/
  Reset_IRQn                = -15, /* -15 Reset Vector, invoked on Power up and warm reset */
  NonMaskableInt_IRQn       = -14, /* -14 Non maskable Interrupt, cannot be stopped or preempted */
  HardFault_IRQn            = -13, /* -13 Hard Fault, all classes of Fault    */
  MemoryManagement_IRQn     = -12, /* -12 Memory Management, MPU mismatch, including Access Violation and No Match */
  BusFault_IRQn             = -11, /* -11 Bus Fault, Pre-Fetch-, Memory Access Fault, other address/memory related Fault */
  UsageFault_IRQn           = -10, /* -10 Usage Fault, i.e. Undef Instruction, Illegal State Transition */
  SecureFault_IRQn          =  -9, /* -9  Secure Fault                        */
  SVCall_IRQn               =  -5, /* -5  System Service Call via SVC instruction */
  DebugMonitor_IRQn         =  -4, /* -4  Debug Monitor                       */
  PendSV_IRQn               =  -2, /* -2  Pendable request for system service */
  SysTick_IRQn              =  -1, /* -1  System Tick Timer                   */

/* ************* PIC32CK1012SG01064 specific Interrupt Numbers ************** */
  FCR_ERR_IRQn              =   0, /* 0   Flash Read Controller (FCR) (FCR)   */
  FCR_FLT_IRQn              =   1, /* 1   Flash Read Controller (FCR) (FCR)   */
  FCW_IRQn                  =   2, /* 2   Flash Write Control (FCW) (FCW)     */
  PM_IRQn                   =   3, /* 3   Power Manager (PM)                  */
  SUPC_IRQn                 =   4, /* 4   Supply Controller (SUPC)            */
  OSCCTRL_XOSC_IRQn         =   5, /* 5   Oscillators Control (OSCCTRL)       */
  OSCCTRL_DFLL_IRQn         =   6, /* 6   Oscillators Control (OSCCTRL)       */
  OSCCTRL_PLL0_IRQn         =   7, /* 7   Oscillators Control (OSCCTRL)       */
  OSC32KCTRL_IRQn           =   8, /* 8   32kHz Oscillators Control (OSC32KCTRL) */
  MCLK_IRQn                 =   9, /* 9   Main Clock (MCLK)                   */
  FREQM_IRQn                =  10, /* 10  Frequency Meter (FREQM)             */
  WDT_IRQn                  =  11, /* 11  Watchdog Timer (WDT)                */
  RTC_IRQn                  =  12, /* 12  Real-Time Counter (RTC)             */
  EIC_EXTINT_0_IRQn         =  13, /* 13  External Interrupt Controller (EIC) */
  EIC_EXTINT_1_IRQn         =  14, /* 14  External Interrupt Controller (EIC) */
  EIC_EXTINT_2_IRQn         =  15, /* 15  External Interrupt Controller (EIC) */
  EIC_EXTINT_3_IRQn         =  16, /* 16  External Interrupt Controller (EIC) */
  EIC_EXTINT_4_IRQn         =  17, /* 17  External Interrupt Controller (EIC) */
  EIC_EXTINT_5_IRQn         =  18, /* 18  External Interrupt Controller (EIC) */
  EIC_EXTINT_6_IRQn         =  19, /* 19  External Interrupt Controller (EIC) */
  EIC_EXTINT_7_IRQn         =  20, /* 20  External Interrupt Controller (EIC) */
  EIC_EXTINT_8_IRQn         =  21, /* 21  External Interrupt Controller (EIC) */
  EIC_EXTINT_9_IRQn         =  22, /* 22  External Interrupt Controller (EIC) */
  EIC_EXTINT_10_IRQn        =  23, /* 23  External Interrupt Controller (EIC) */
  EIC_EXTINT_11_IRQn        =  24, /* 24  External Interrupt Controller (EIC) */
  EIC_EXTINT_12_IRQn        =  25, /* 25  External Interrupt Controller (EIC) */
  EIC_EXTINT_13_IRQn        =  26, /* 26  External Interrupt Controller (EIC) */
  EIC_EXTINT_14_IRQn        =  27, /* 27  External Interrupt Controller (EIC) */
  EIC_EXTINT_15_IRQn        =  28, /* 28  External Interrupt Controller (EIC) */
  EIC_NSCHK_IRQn            =  29, /* 29  External Interrupt Controller (EIC) */
  PAC_IRQn                  =  30, /* 30  Peripheral Access Controller (PAC)  */
  TRAM_IRQn                 =  31, /* 31  TrustRAM (TRAM)                     */
  PORT_IRQn                 =  32, /* 32  Port Module (PORT)                  */
  DMA0_PRI0_IRQn            =  33, /* 33  Direct Memory Access Controller (DMA0) */
  DMA0_PRI1_IRQn            =  34, /* 34  Direct Memory Access Controller (DMA0) */
  DMA0_PRI2_IRQn            =  35, /* 35  Direct Memory Access Controller (DMA0) */
  DMA1_PRI0_IRQn            =  36, /* 36  Direct Memory Access Controller (DMA1) */
  DMA1_PRI1_IRQn            =  37, /* 37  Direct Memory Access Controller (DMA1) */
  HMATRIX_IRQn              =  38, /* 38  HSB Matrix (HMATRIX)                */
  EVSYS_0_IRQn              =  39, /* 39  Event System Interface (EVSYS)      */
  EVSYS_1_IRQn              =  40, /* 40  Event System Interface (EVSYS)      */
  EVSYS_2_IRQn              =  41, /* 41  Event System Interface (EVSYS)      */
  EVSYS_3_IRQn              =  42, /* 42  Event System Interface (EVSYS)      */
  EVSYS_OTHER_IRQn          =  43, /* 43  Event System Interface (EVSYS)      */
  SERCOM0_56_IRQn           =  44, /* 44  Serial Communication Interface (SERCOM0) */
  SERCOM0_0_IRQn            =  45, /* 45  Serial Communication Interface (SERCOM0) */
  SERCOM0_1_IRQn            =  46, /* 46  Serial Communication Interface (SERCOM0) */
  SERCOM0_2_IRQn            =  47, /* 47  Serial Communication Interface (SERCOM0) */
  SERCOM0_3_IRQn            =  48, /* 48  Serial Communication Interface (SERCOM0) */
  SERCOM0_4_IRQn            =  49, /* 49  Serial Communication Interface (SERCOM0) */
  SERCOM1_56_IRQn           =  50, /* 50  Serial Communication Interface (SERCOM1) */
  SERCOM1_0_IRQn            =  51, /* 51  Serial Communication Interface (SERCOM1) */
  SERCOM1_1_IRQn            =  52, /* 52  Serial Communication Interface (SERCOM1) */
  SERCOM1_2_IRQn            =  53, /* 53  Serial Communication Interface (SERCOM1) */
  SERCOM1_3_IRQn            =  54, /* 54  Serial Communication Interface (SERCOM1) */
  SERCOM1_4_IRQn            =  55, /* 55  Serial Communication Interface (SERCOM1) */
  SERCOM2_56_IRQn           =  56, /* 56  Serial Communication Interface (SERCOM2) */
  SERCOM2_0_IRQn            =  57, /* 57  Serial Communication Interface (SERCOM2) */
  SERCOM2_1_IRQn            =  58, /* 58  Serial Communication Interface (SERCOM2) */
  SERCOM2_2_IRQn            =  59, /* 59  Serial Communication Interface (SERCOM2) */
  SERCOM2_3_IRQn            =  60, /* 60  Serial Communication Interface (SERCOM2) */
  SERCOM2_4_IRQn            =  61, /* 61  Serial Communication Interface (SERCOM2) */
  SERCOM3_56_IRQn           =  62, /* 62  Serial Communication Interface (SERCOM3) */
  SERCOM3_0_IRQn            =  63, /* 63  Serial Communication Interface (SERCOM3) */
  SERCOM3_1_IRQn            =  64, /* 64  Serial Communication Interface (SERCOM3) */
  SERCOM3_2_IRQn            =  65, /* 65  Serial Communication Interface (SERCOM3) */
  SERCOM3_3_IRQn            =  66, /* 66  Serial Communication Interface (SERCOM3) */
  SERCOM3_4_IRQn            =  67, /* 67  Serial Communication Interface (SERCOM3) */
  TCC0_OTHER_IRQn           =  68, /* 68  Timer Counter for Control Applications (TCC0) */
  TCC0_MC0_IRQn             =  69, /* 69  Timer Counter for Control Applications (TCC0) */
  TCC0_MC1_IRQn             =  70, /* 70  Timer Counter for Control Applications (TCC0) */
  TCC0_MC2_IRQn             =  71, /* 71  Timer Counter for Control Applications (TCC0) */
  TCC0_MC3_IRQn             =  72, /* 72  Timer Counter for Control Applications (TCC0) */
  TCC0_MC4_IRQn             =  73, /* 73  Timer Counter for Control Applications (TCC0) */
  TCC0_MC5_IRQn             =  74, /* 74  Timer Counter for Control Applications (TCC0) */
  TCC1_OTHER_IRQn           =  75, /* 75  Timer Counter for Control Applications (TCC1) */
  TCC1_MC0_IRQn             =  76, /* 76  Timer Counter for Control Applications (TCC1) */
  TCC1_MC1_IRQn             =  77, /* 77  Timer Counter for Control Applications (TCC1) */
  TCC1_MC2_IRQn             =  78, /* 78  Timer Counter for Control Applications (TCC1) */
  TCC1_MC3_IRQn             =  79, /* 79  Timer Counter for Control Applications (TCC1) */
  TCC1_MC4_IRQn             =  80, /* 80  Timer Counter for Control Applications (TCC1) */
  TCC1_MC5_IRQn             =  81, /* 81  Timer Counter for Control Applications (TCC1) */
  TCC2_OTHER_IRQn           =  82, /* 82  Timer Counter for Control Applications (TCC2) */
  TCC2_MC0_IRQn             =  83, /* 83  Timer Counter for Control Applications (TCC2) */
  TCC2_MC1_IRQn             =  84, /* 84  Timer Counter for Control Applications (TCC2) */
  TCC2_MC2_IRQn             =  85, /* 85  Timer Counter for Control Applications (TCC2) */
  TCC2_MC3_IRQn             =  86, /* 86  Timer Counter for Control Applications (TCC2) */
  TCC2_MC4_IRQn             =  87, /* 87  Timer Counter for Control Applications (TCC2) */
  TCC2_MC5_IRQn             =  88, /* 88  Timer Counter for Control Applications (TCC2) */
  TCC3_OTHER_IRQn           =  89, /* 89  Timer Counter for Control Applications (TCC3) */
  TCC3_MC0_IRQn             =  90, /* 90  Timer Counter for Control Applications (TCC3) */
  TCC3_MC1_IRQn             =  91, /* 91  Timer Counter for Control Applications (TCC3) */
  TCC3_MC2_IRQn             =  92, /* 92  Timer Counter for Control Applications (TCC3) */
  TCC3_MC3_IRQn             =  93, /* 93  Timer Counter for Control Applications (TCC3) */
  TCC3_MC4_IRQn             =  94, /* 94  Timer Counter for Control Applications (TCC3) */
  TCC3_MC5_IRQn             =  95, /* 95  Timer Counter for Control Applications (TCC3) */
  SERCOM4_56_IRQn           =  96, /* 96  Serial Communication Interface (SERCOM4) */
  SERCOM4_0_IRQn            =  97, /* 97  Serial Communication Interface (SERCOM4) */
  SERCOM4_1_IRQn            =  98, /* 98  Serial Communication Interface (SERCOM4) */
  SERCOM4_2_IRQn            =  99, /* 99  Serial Communication Interface (SERCOM4) */
  SERCOM4_3_IRQn            = 100, /* 100 Serial Communication Interface (SERCOM4) */
  SERCOM4_4_IRQn            = 101, /* 101 Serial Communication Interface (SERCOM4) */
  SERCOM5_56_IRQn           = 102, /* 102 Serial Communication Interface (SERCOM5) */
  SERCOM5_0_IRQn            = 103, /* 103 Serial Communication Interface (SERCOM5) */
  SERCOM5_1_IRQn            = 104, /* 104 Serial Communication Interface (SERCOM5) */
  SERCOM5_2_IRQn            = 105, /* 105 Serial Communication Interface (SERCOM5) */
  SERCOM5_3_IRQn            = 106, /* 106 Serial Communication Interface (SERCOM5) */
  SERCOM5_4_IRQn            = 107, /* 107 Serial Communication Interface (SERCOM5) */
  TCC4_OTHER_IRQn           = 120, /* 120 Timer Counter for Control Applications (TCC4) */
  TCC4_MC0_IRQn             = 121, /* 121 Timer Counter for Control Applications (TCC4) */
  TCC4_MC1_IRQn             = 122, /* 122 Timer Counter for Control Applications (TCC4) */
  TCC5_OTHER_IRQn           = 123, /* 123 Timer Counter for Control Applications (TCC5) */
  TCC5_MC0_IRQn             = 124, /* 124 Timer Counter for Control Applications (TCC5) */
  TCC5_MC1_IRQn             = 125, /* 125 Timer Counter for Control Applications (TCC5) */
  ADC_GLOBAL_IRQn           = 132, /* 132 ADC Controller (ADC)                */
  ADC_CORE1_IRQn            = 133, /* 133 ADC Controller (ADC)                */
  Reserved2_IRQn            = 134, /* 134 ADC Controller (ADC)                */
  Reserved3_IRQn            = 135, /* 135 ADC Controller (ADC)                */
  Reserved4_IRQn            = 136, /* 136 ADC Controller (ADC)                */
  Reserved5_IRQn            = 137, /* 137 ADC Controller (ADC)                */
  AC_IRQn                   = 138, /* 138 Analog Comparator Controller (AC)   */
  PTC_IRQn                  = 139, /* 139 Peripheral Touch Controller (PTC)   */
  SPI_IXS_IRQn              = 140, /* 140 Audio SPI with 8 channels compatibilty (SPI_IXS) */
  PCC_IRQn                  = 141, /* 141 Parallel Capture Controller (PCC)   */
  PDEC_IRQn                 = 142, /* 142 Position Decoder (PDEC)             */
  CAN0_IRQn                 = 143, /* 143 Control Area Network (CAN0)         */
  ETH_IRQn                  = 145, /* 145 Ethernet Controller (ETH)           */
  SQI_IRQn                  = 146, /* 146 Polaris Serial Quad Interface SIB (SQI) */
  TRNG_IRQn                 = 147, /* 147 True Random Generator (TRNG)        */
  SDMMC0_IRQn               = 148, /* 148 SD/MMC Host Controller (SDMMC0)     */
  USB_OTHER_IRQn            = 150, /* 150 Full-Speed Universal Serial Bus (USB) */
  USB_SOF_IRQn              = 151, /* 151 Full-Speed Universal Serial Bus (USB) */
  USB_TRCPT0_IRQn           = 152, /* 152 Full-Speed Universal Serial Bus (USB) */
  USB_TRCPT1_IRQn           = 153, /* 153 Full-Speed Universal Serial Bus (USB) */
  HSM_ERROR_IRQn            = 155, /* 155 Hardware Security Module (HSM)      */
  HSM_TXINT_IRQn            = 156, /* 156 Hardware Security Module (HSM)      */
  HSM_RXINT_IRQn            = 157, /* 157 Hardware Security Module (HSM)      */
  FLEXRAM_IRQn              = 158, /* 158 Multi-Channel RAM Controller (FLEXRAM) */

